; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_1 ?v11 ?v4)
             (pred_11 ?v3 ?v10)
             (pred_4 ?v11 ?v10)
             (pred_5 ?v5 ?v11 )
	     (pred_12 ?v11)
             (pred_9 ?v6)
             (pred_2 ?v3)
             (pred_3 ?v10)
             (pred_7 ?v11)
             (pred_10 ?v3)
             (pred_6 ?v11)
             (pred_8 ))



(:action op_5
:parameters (?v8 ?v12 ?v13 ?v7)
:precondition (and (pred_9 ?v8) (pred_9 ?v12) (pred_2 ?v13) (pred_3 ?v7)
          (pred_1 ?v8 ?v12) (pred_11 ?v13 ?v7)
                   (pred_4 ?v12 ?v7) (pred_12 ?v8) 
                   (pred_7 ?v12) (pred_10 ?v13))
:effect (and  (pred_6 ?v12) (not (pred_7 ?v12))))


(:action op_3
:parameters (?v8 ?v9)
:precondition (and (pred_9 ?v8) (pred_9 ?v9)
               (pred_12 ?v8) (pred_1 ?v8 ?v9) (pred_6 ?v9))
:effect (and (pred_12 ?v9) (not (pred_12 ?v8))))

(:action op_1
:parameters (?v8 ?v13)
:precondition (and (pred_9 ?v8) (pred_2 ?v13) 
                  (pred_12 ?v8) (pred_5 ?v13 ?v8) (pred_8 ))
:effect (and (pred_10 ?v13)
   (not (pred_5 ?v13 ?v8)) (not (pred_8 ))))


(:action op_4
:parameters (?v8 ?v1 ?v2)
:precondition (and (pred_9 ?v8) (pred_2 ?v1) (pred_2 ?v2)
                  (pred_12 ?v8) (pred_10 ?v2) (pred_5 ?v1 ?v8))
:effect (and (pred_10 ?v1) (pred_5 ?v2 ?v8)
        (not (pred_10 ?v2)) (not (pred_5 ?v1 ?v8))))

(:action op_2
:parameters (?v8 ?v13)
:precondition (and (pred_9 ?v8) (pred_2 ?v13) 
                  (pred_12 ?v8) (pred_10 ?v13))
:effect (and (pred_8 ) (pred_5 ?v13 ?v8) (not (pred_10 ?v13)))))

; problem
(define (problem grid-3-3-2-2-2)
    (:domain grid)
    (:objects
    obj_07 obj_11 obj_10 obj_12 obj_03 obj_08 obj_01 obj_04 obj_05
    obj_02 obj_06
    obj_09 obj_13
    )

    (:init
       (pred_8)

       (pred_9 obj_07)
       (pred_9 obj_11)
       (pred_9 obj_10)
       (pred_9 obj_12)
       (pred_9 obj_03)
       (pred_9 obj_08)
       (pred_9 obj_01)
       (pred_9 obj_04)
       (pred_9 obj_05)
       (pred_3 obj_02)
       (pred_3 obj_06)
       (pred_2 obj_09)
       (pred_2 obj_13)

       (pred_1 obj_07 obj_12)
       (pred_1 obj_07 obj_11)
       (pred_1 obj_11 obj_03)
       (pred_1 obj_11 obj_10)
       (pred_1 obj_11 obj_07)
       (pred_1 obj_10 obj_08)
       (pred_1 obj_10 obj_11)
       (pred_1 obj_12 obj_01)
       (pred_1 obj_12 obj_03)
       (pred_1 obj_12 obj_07)
       (pred_1 obj_03 obj_04)
       (pred_1 obj_03 obj_08)
       (pred_1 obj_03 obj_11)
       (pred_1 obj_03 obj_12)
       (pred_1 obj_08 obj_05)
       (pred_1 obj_08 obj_10)
       (pred_1 obj_08 obj_03)
       (pred_1 obj_01 obj_04)
       (pred_1 obj_01 obj_12)
       (pred_1 obj_04 obj_05)
       (pred_1 obj_04 obj_03)
       (pred_1 obj_04 obj_01)
       (pred_1 obj_05 obj_08)
       (pred_1 obj_05 obj_04)
       (pred_7 obj_01)
       (pred_7 obj_07)
       (pred_4  obj_01 obj_02)
       (pred_4  obj_07 obj_06)
       (pred_6 obj_11)
       (pred_6 obj_10)
       (pred_6 obj_12)
       (pred_6 obj_03)
       (pred_6 obj_08)
       (pred_6 obj_04)
       (pred_6 obj_05)

       (pred_11  obj_09 obj_02)
       (pred_11  obj_13 obj_06)
       (pred_5 obj_09 obj_12)
       (pred_5 obj_13 obj_04)
       (pred_12 obj_10)
    )

    (:goal (and
       (pred_5 obj_13 obj_08)
    ))
(:constraints
  (always (not (pred_12 obj_03)))
)
)

; plan
1. (op_3 obj_10 obj_08)
   deleted: (pred_12 obj_10)
   added: (pred_12 obj_08)
   goals met: 0 of 1
2. (op_3 obj_08 obj_05)
   deleted: (pred_12 obj_08)
   added: (pred_12 obj_05)
   goals met: 0 of 1
3. (op_3 obj_05 obj_04)
   deleted: (pred_12 obj_05)
   added: (pred_12 obj_04)
   goals met: 0 of 1
4. (op_1 obj_04 obj_13)
   deleted: (pred_5 obj_13 obj_04) (pred_8)
   added: (pred_10 obj_13)
   goals met: 0 of 1
5. (op_3 obj_04 obj_05)
   deleted: (pred_12 obj_04)
   added: (pred_12 obj_05)
   goals met: 0 of 1
6. (op_3 obj_05 obj_08)
   deleted: (pred_12 obj_05)
   added: (pred_12 obj_08)
   goals met: 0 of 1
7. (op_2 obj_08 obj_13)
   deleted: (pred_10 obj_13)
   added: (pred_8) (pred_5 obj_13 obj_08)
   goals met: 1 of 1
